trunk/raw/documents/zh_CN.org
#+BEGIN_COMMENT
User guide (Simplified Chinese).

Copyright (C) 2010-2012.

This file is part of Redirector.

Redirector is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

Redirector is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with Redirector.  If not, see <http://www.gnu.org/licenses/>.

From Cyril Feng.
#+END_COMMENT

#+TITLE:     Redirector指南
#+AUTHOR:    Cyril Feng
#+EMAIL:     CyrilFeng@gmail.com
#+DATE:      2012-03-16
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  zh-CN
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STYLE: <style>table{margin:auto auto;}</style>
#+STYLE: <style>body{padding:0 20px;}</style>
#+STYLE: <style>i{font-weight:bold;}</style>
#+STYLE: <style>code{background-color:lightgray;font-size:90%}</style>

* 前言
  这份指南旨在介绍一个可以自动／手动重定向URL的 /Chromium/ / /Google Chrome/
  插件—— /Redirector/ 。
  这份指南将着重解释规则的编写，而不求顾及此插件使用的每个方面。

* 符号约定
  - /Cr/ :: /Chromium/ / /Google Chrome/ 浏览器

  - /正则/ :: 正则表达式

  - =~ :: 匹配或被匹配

  - !~ :: 不匹配或不被匹配

  - @<code>...@</code> :: 内容占位符

  - -> :: 重定向至

* 工作机制
  /Redirector/ 会在每个web请求产生之初处理它，
  这时DNS解析、与服务器建立连接等都还没有开始。
  提醒一下，当你浏览一个网页时，很有可能会产生多个web请求，比如用来加载图片；
  不过 /Redirector/ 会处理全部这些请求。

  /Redirector/ 会首先检查是否有规则匹配请求的URL。
  如果是，则URL会根据第一条匹配的规则进行相应地修改／封锁。

  *注意：*
  这个过程 *只发生一次* 。
  事实上被重定向的URL会触发一个相同的过程，只不过 /Redirector/ 会忽略它。
  这对服务器端发起的重定向也是适用的。
  这种机制可以避免（无限）重定向循环的产生，否则 /Cr/ 很容易假死。
  其实，即使 /Redirector/ 执行了第二次重定向，接下来也不会有第三次，
  这是由 /Cr/ 内在的安全性所决定的。

  手动重定向相当于是上述的强制过程，即不执行匹配检查。

  /Redirector/ 修改HTTP请求头是另一个独立但相似的过程。
  如果有规则匹配一个请求的URL，则第一条规则会被用来修改它的头。

  *注意：*
  这个过程通常 *只发生一次* ，但有一个例外：
  如果服务器端触发了一次重定向， /Redirector/ 会尝试再次修改请求头。
  这是因为之前的头已经被发送，现有的头是新生成的。

  /Redirector/ 自带了一个调试器，很适合用来监视上述过程。
  它可以帮助你理解内部的时序关系。
  比如，你会注意到头处理总是发生在重定向检查之后。
  如果在头处理之后发生了一次重定向，那么这很有可能是服务器端发起的。

* 基本使用
  这一部分将介绍 /Redirector/ 的配置及基本的规则编写。

** 协议
   正常情况下， /Redirector/ 处理 =HTTP://= 、 =HTTPS://= 、 =FTP://= 、
   =FILE://= 这几种协议，你也可以在 /首选项/ 标签页下禁用其中的协议。

   *注意：* 最好不要试图处理 =chrome://= 等协议，虽然 /Redirector/ 可以做到。

** 手动重定向
   尽管 /Redirector/ 的主要功能是自动重定向，但自动重定向并不胜任所有情况。
   手动重定向作为其补充，共有两种形式：

   - 右键单击链接并选择一条规则，将会在新标签页打开经规则处理过的链接；
   - 右键单击页面并选择一条规则，将会重新载入经规则处理过的当前页URL。

   *注意：* 你必须创建并启用了至少一条[[BASIC-MATCH-MANUAL][手动规则]]，否则右键菜单里不会出现任何关于
   /Redirector/ 的信息。

** 配置规则
   使用 /添加/ 按钮添加一条规则，这时将会出现规则编辑器。
   你可以选择一条内置的规则或是自己编写当前的规则。

   *注意：* 内置规则仅供参考。其中的一些规则只是框架，应在修改后使用。

   你可以通过 /编辑/ 按钮编辑已有的规则，或是用 /删除/ 进行删除。
   如果有多条规则，你可以通过 /上移/ 、 /下移/ 按钮改变优先级。

   *注意：* 规则是从上到下搜索的，并且禁用的规则会被忽略。

   /备份/ 按钮可以备份规则列表，你需要自行复制备份结果并保存到别处。
   另外你可以通过 /还原/ 按钮还原备份。

** 规则的基本格式
*** 名称
    规则的名称，应尽量容易区分。

*** 匹配
    匹配模式用于确定规则是否适用于特定的URL。
    你可以勾选 /忽略大小写/ 选项进行大小写不敏感的匹配。
    匹配有主要三种形式：
**** /正则/
     用 /正则/ 进行匹配将会在[[ADVANCED_MATCH][高级匹配]]中介绍。
**** 通配符
     通配符其实就是基本的字符串，除了两个字符：
     - ~?~ :: 匹配任意单个字符，例如：
              - ~https://www.google.com.??/~
                =~ ~https://www.google.com.hk/~.


     - ~*~ :: 匹配任意长字符串，包括零字符串。

     *注意：*
     - 若要直接匹配上述两个字符，请分别使用 ~\?~ 和 ~\*~ 。
     - URL只要部分匹配就算匹配上。如要严格地匹配，参见 /智能通配符/ 。

#<<BASIC-MATCH-MANUAL>>
**** 手动
     特殊的匹配方式，意指规则用于手动重定向。

**** 智能通配符
     引入 /智能通配符/ 是为了简化匹配模式的编写。特点：
     - /智能通配符/ 进行严格的匹配
     - 无协议的模式将匹配http:// 或 https://
     - 无路径、查询字串或段标识符的模式会自动附加上隐含的斜线

*** 被替换式
    /被替换式/ 指明URL中的哪些部分需要被替换。
    /被替换式/ 的搜索同样可以忽略大小写；
    另外你也可以勾选 /多次替换/ ，这样所有符合要求的子串都会被替换。

    /被替换式/ 同样有三种形式：
**** /正则/
     使用 /正则/ 搜索 /被替换式/ 将在[[ADVANCED_SUBSTITUTION][高级替换]]中介绍。

**** 通配符
     同 /匹配/ 中的通配符。

**** 封锁
     /Redirector/ 除了重定向，也可以封锁一条请求。

**** 请求头
     这个选项用来修改“HTTP请求头”。
     这时 /被替换式/ 应是要修改的请求头的名字。
     如果一个请求头不存在，那么它会被创建。
     要删除一个请求头，请在名称前放置减号 ~-~ 。
     如有多条请求头要修改，用竖线 ~|~ 分隔。

*** 替换式
    /替换式/ 用作 /被替换式/ 的填充。
    你可以使用普通的字符串，不过注意 ~$~ 应写作 ~$$~ ，因为
    [[ADVANCED_SUBSTITUTION][高级替换]]
    中会用到它。

    /译码/ 选项用作对最终URL中被编码的字符进行译码，比如
    - ~http%3A%2F%2Fwww.google.com%2F~ 译为 ~http://www.google.com/~ 。

    值得注意的是，若 /被替换式/ 是请求头类型的，则替换式应当是对应的值，也用竖线 ~|~ 分隔。
    若值中包括字面意义的竖线 ~|~ ，请使用 ~\|~ 代替。
    对于要删除的请求头，对应的值可以留空。

** 测试
   你应当测试每条编写的规则，否则可能会导致 /Cr/ 假死或者抱怨"He's Dead, Jim!"。
   规则编辑器包括一个简单的测试工具。
   这里只提醒几点：
   - 当编写一条新规则时，选择手动模式，然后编写 /被替换式/ 和 /替换式/ 。
     测试通过后再进行下一步。
     编写 /匹配/ 前请先保存 /被替换式/ 和 /替换式/ 。

   - 当调试一条已有规则时，先简化可能错误的部分。
     规则弄乱了也没关系，直接放弃修改然后重新开始。

   如果一切顺利，测试结果将会显示出来，其中被替换和替换上去的部分会被着色。

** 调试器
   /Redirector/ 自版本2.2.8 引入了调试器，以便更容易发现规则的问题。
   注意事项：

   - 每条调试记录的第一行指示时序。
     第一条记录以 ~[时:分:秒]~ 的形式表示，其余以 ~[+经过的毫秒数 ms]~ 呈现。

   - /测速/ 选项必然会拖慢整个调试过程，因为 /Redirector/ 会测试一百万次以得到结果。
     比方说，如果一次重定向用时 0.5@<span>\mu@</span>s ，
     那么你很可能会感受到0.5s的延迟。

   - 重定向和头修改用时之和即可估计 /Redirector/ 真实需时。

#<<ADVANCED_MATCH>>
