trunk/html/zh_CN.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Redirector指南</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Redirector指南"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-16"/>
<meta name="author" content="Cyril Feng"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Redirector指南</h1>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 符号约定</a></li>
<li><a href="#sec-3">3 工作机制</a></li>
<li><a href="#sec-4">4 基本使用</a>
<ul>
<li><a href="#sec-4-1">4.1 协议</a></li>
<li><a href="#sec-4-2">4.2 手动重定向</a></li>
<li><a href="#sec-4-3">4.3 配置规则</a></li>
<li><a href="#sec-4-4">4.4 规则的基本格式</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 名称</a></li>
<li><a href="#sec-4-4-2">4.4.2 匹配</a></li>
<li><a href="#sec-4-4-3">4.4.3 被替换式</a></li>
<li><a href="#sec-4-4-4">4.4.4 替换式</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 测试</a></li>
<li><a href="#sec-4-6">4.6 调试器</a></li>
</ul>
</li>
<li><a href="#sec-5">5 高级匹配</a></li>
<li><a href="#sec-6">6 高级替换</a></li>
<li><a href="#sec-7">7 故障处置</a></li>
<li><a href="#sec-8">8 建议</a>
<ul>
<li><a href="#sec-8-1">8.1 编写高效的 <i>匹配</i> 模式</a></li>
<li><a href="#sec-8-2">8.2 编写可维护的 <i>被替换式</i></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">

<p>  这份指南旨在介绍一个可以自动／手动重定向URL的 <i>Chromium</i> / <i>Google Chrome</i>
  插件—— <i>Redirector</i> 。
  这份指南将着重解释规则的编写，而不求顾及此插件使用的每个方面。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 符号约定</h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt><i>Cr</i></dt><dd><i>Chromium</i> / <i>Google Chrome</i> 浏览器

</dd>
<dt><i>正则</i></dt><dd>正则表达式

</dd>
<dt>=~</dt><dd>匹配或被匹配

</dd>
<dt>!~</dt><dd>不匹配或不被匹配

</dd>
<dt><code>&hellip;</code></dt><dd>内容占位符

</dd>
<dt>-&gt;</dt><dd>重定向至
</dd>
</dl>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 工作机制</h2>
<div class="outline-text-2" id="text-3">

<p>  <i>Redirector</i> 会在每个web请求产生之初处理它，
  这时DNS解析、与服务器建立连接等都还没有开始。
  提醒一下，当你浏览一个网页时，很有可能会产生多个web请求，比如用来加载图片；
  不过 <i>Redirector</i> 会处理全部这些请求。
</p>
<p>
  <i>Redirector</i> 会首先检查是否有规则匹配请求的URL。
  如果是，则URL会根据第一条匹配的规则进行相应地修改／封锁。
</p>
<p>
  <b>注意：</b>
  这个过程 <b>只发生一次</b> 。
  事实上被重定向的URL会触发一个相同的过程，只不过 <i>Redirector</i> 会忽略它。
  这对服务器端发起的重定向也是适用的。
  这种机制可以避免（无限）重定向循环的产生，否则 <i>Cr</i> 很容易假死。
  其实，即使 <i>Redirector</i> 执行了第二次重定向，接下来也不会有第三次，
  这是由 <i>Cr</i> 内在的安全性所决定的。
</p>
<p>
  手动重定向相当于是上述的强制过程，即不执行匹配检查。
</p>
<p>
  <i>Redirector</i> 修改HTTP请求头是另一个独立但相似的过程。
  如果有规则匹配一个请求的URL，则第一条规则会被用来修改它的头。
</p>
<p>
  <b>注意：</b>
  这个过程通常 <b>只发生一次</b> ，但有一个例外：
  如果服务器端触发了一次重定向， <i>Redirector</i> 会尝试再次修改请求头。
  这是因为之前的头已经被发送，现有的头是新生成的。
</p>
<p>
  <i>Redirector</i> 自带了一个调试器，很适合用来监视上述过程。
  它可以帮助你理解内部的时序关系。
  比如，你会注意到头处理总是发生在重定向检查之后。
  如果在头处理之后发生了一次重定向，那么这很有可能是服务器端发起的。
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 基本使用</h2>
<div class="outline-text-2" id="text-4">

<p>  这一部分将介绍 <i>Redirector</i> 的配置及基本的规则编写。
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 协议</h3>
<div class="outline-text-3" id="text-4-1">

<p>   正常情况下， <i>Redirector</i> 处理 <code>HTTP://</code> 、 <code>HTTPS://</code> 、 <code>FTP://</code> 、
   <code>FILE://</code> 这几种协议，你也可以在 <i>首选项</i> 标签页下禁用其中的协议。
</p>
<p>
   <b>注意：</b> 最好不要试图处理 <code>chrome://</code> 等协议，虽然 <i>Redirector</i> 可以做到。
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 手动重定向</h3>
<div class="outline-text-3" id="text-4-2">

<p>   尽管 <i>Redirector</i> 的主要功能是自动重定向，但自动重定向并不胜任所有情况。
   手动重定向作为其补充，共有两种形式：
</p>
<ul>
<li>右键单击链接并选择一条规则，将会在新标签页打开经规则处理过的链接；
</li>
<li>右键单击页面并选择一条规则，将会重新载入经规则处理过的当前页URL。
</li>
</ul>


<p>
   <b>注意：</b> 你必须创建并启用了至少一条<a href="#sec-4-4-2-3">手动规则</a>，否则右键菜单里不会出现任何关于
   <i>Redirector</i> 的信息。
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 配置规则</h3>
<div class="outline-text-3" id="text-4-3">

<p>   使用 <i>添加</i> 按钮添加一条规则，这时将会出现规则编辑器。
   你可以选择一条内置的规则或是自己编写当前的规则。
</p>
<p>
   <b>注意：</b> 内置规则仅供参考。其中的一些规则只是框架，应在修改后使用。
</p>
<p>
   你可以通过 <i>编辑</i> 按钮编辑已有的规则，或是用 <i>删除</i> 进行删除。
   如果有多条规则，你可以通过 <i>上移</i> 、 <i>下移</i> 按钮改变优先级。
</p>
<p>
   <b>注意：</b> 规则是从上到下搜索的，并且禁用的规则会被忽略。
</p>
<p>
   <i>备份</i> 按钮可以备份规则列表，你需要自行复制备份结果并保存到别处。
   另外你可以通过 <i>还原</i> 按钮还原备份。
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 规则的基本格式</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> 名称</h4>
<div class="outline-text-4" id="text-4-4-1">

<p>    规则的名称，应尽量容易区分。
</p>
</div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 匹配</h4>
<div class="outline-text-4" id="text-4-4-2">

<p>    匹配模式用于确定规则是否适用于特定的URL。
    你可以勾选 <i>忽略大小写</i> 选项进行大小写不敏感的匹配。
    匹配有主要三种形式：
</p><ul>
<li id="sec-4-4-2-1"><i>正则</i><br/>
     用 <i>正则</i> 进行匹配将会在<a href="#sec-5">高级匹配</a>中介绍。
</li>
</ul>
<ul>
<li id="sec-4-4-2-2">通配符<br/>
     通配符其实就是基本的字符串，除了两个字符：
<dl>
<dt><code>?</code></dt><dd>匹配任意单个字符，例如：
<ul>
<li><code>https://www.google.com.??/</code>
                =~ <code>https://www.google.com.hk/</code>.
</li>
</ul>

</dd>
</dl>



<dl>
<dt><code>*</code></dt><dd>匹配任意长字符串，包括零字符串。
</dd>
</dl>


<p>
     <b>注意：</b>
</p><ul>
<li>若要直接匹配上述两个字符，请分别使用 <code>\?</code> 和 <code>\*</code> 。
</li>
<li>URL只要部分匹配就算匹配上。如要严格地匹配，参见 <i>智能通配符</i> 。
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-4-4-2-3"><a name="BASIC-MATCH-MANUAL" id="BASIC-MATCH-MANUAL"></a>手动<br/>
     特殊的匹配方式，意指规则用于手动重定向。

</li>
</ul>
<ul>
<li id="sec-4-4-2-4">智能通配符<br/>
     引入 <i>智能通配符</i> 是为了简化匹配模式的编写。特点：
<ul>
<li><i>智能通配符</i> 进行严格的匹配
</li>
<li>无协议的模式将匹配<a href="http://">http://</a> 或 <a href="https://">https://</a>
</li>
<li>无路径、查询字串或段标识符的模式会自动附加上隐含的斜线
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> 被替换式</h4>
<div class="outline-text-4" id="text-4-4-3">

<p>    <i>被替换式</i> 指明URL中的哪些部分需要被替换。
    <i>被替换式</i> 的搜索同样可以忽略大小写；
    另外你也可以勾选 <i>多次替换</i> ，这样所有符合要求的子串都会被替换。
</p>
<p>
    <i>被替换式</i> 同样有三种形式：
</p><ul>
<li id="sec-4-4-3-1"><i>正则</i><br/>
     使用 <i>正则</i> 搜索 <i>被替换式</i> 将在<a href="#sec-6">高级替换</a>中介绍。

</li>
</ul>
<ul>
<li id="sec-4-4-3-2">通配符<br/>
     同 <i>匹配</i> 中的通配符。

</li>
</ul>
<ul>
<li id="sec-4-4-3-3">封锁<br/>
     <i>Redirector</i> 除了重定向，也可以封锁一条请求。

</li>
</ul>
<ul>
<li id="sec-4-4-3-4">请求头<br/>
     这个选项用来修改“HTTP请求头”。
     这时 <i>被替换式</i> 应是要修改的请求头的名字。
     如果一个请求头不存在，那么它会被创建。
     要删除一个请求头，请在名称前放置减号 <code>-</code> 。
     如有多条请求头要修改，用竖线 <code>|</code> 分隔。

</li>
</ul>
</div>

</div>

<div id="outline-container-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> 替换式</h4>
<div class="outline-text-4" id="text-4-4-4">

<p>    <i>替换式</i> 用作 <i>被替换式</i> 的填充。
    你可以使用普通的字符串，不过注意 <code>$</code> 应写作 <code>$$</code> ，因为
    <a href="#sec-6">高级替换</a>
    中会用到它。
</p>
<p>
    <i>译码</i> 选项用作对最终URL中被编码的字符进行译码，比如
</p><ul>
<li><code>http%3A%2F%2Fwww.google.com%2F</code> 译为 <code>http://www.google.com/</code> 。
</li>
</ul>


<p>
    值得注意的是，若 <i>被替换式</i> 是请求头类型的，则替换式应当是对应的值，也用竖线 <code>|</code> 分隔。
    若值中包括字面意义的竖线 <code>|</code> ，请使用 <code>\|</code> 代替。
    对于要删除的请求头，对应的值可以留空。
</p>
</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 测试</h3>
<div class="outline-text-3" id="text-4-5">

<p>   你应当测试每条编写的规则，否则可能会导致 <i>Cr</i> 假死或者抱怨"He's Dead, Jim!"。
   规则编辑器包括一个简单的测试工具。
   这里只提醒几点：
</p><ul>
<li>当编写一条新规则时，选择手动模式，然后编写 <i>被替换式</i> 和 <i>替换式</i> 。
     测试通过后再进行下一步。
     编写 <i>匹配</i> 前请先保存 <i>被替换式</i> 和 <i>替换式</i> 。

</li>
<li>当调试一条已有规则时，先简化可能错误的部分。
     规则弄乱了也没关系，直接放弃修改然后重新开始。
</li>
</ul>


<p>
   如果一切顺利，测试结果将会显示出来，其中被替换和替换上去的部分会被着色。
</p>
</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 调试器</h3>
<div class="outline-text-3" id="text-4-6">

<p>   <i>Redirector</i> 自版本2.2.8 引入了调试器，以便更容易发现规则的问题。
   注意事项：
</p>
<ul>
<li>每条调试记录的第一行指示时序。
     第一条记录以 <code>[时:分:秒]</code> 的形式表示，其余以 <code>[+经过的毫秒数 ms]</code> 呈现。

</li>
<li><i>测速</i> 选项必然会拖慢整个调试过程，因为 <i>Redirector</i> 会测试一百万次以得到结果。
     比方说，如果一次重定向用时 0.5<span>&mu;</span>s ，
     那么你很可能会感受到0.5s的延迟。

</li>
<li>重定向和头修改用时之和即可估计 <i>Redirector</i> 真实需时。
</li>
</ul>


</div>
</div>

</div>
