trunk/raw/documents/zh_CN.org
* 高级匹配
  /高级匹配/ 指的是使用 /正则/ 进行匹配。
  你可能要去参考其它关于 /正则/ 的文章，但请留意 /正则/ 有很多种，
  这里使用的是JavaScript风格的，类似于Perl风格。

  这份简短的指南显然无法介绍关于 /正则/ 的所有方面，这里只挑选那些与URL匹配有关的。
  对于解释，这里也只抽取那些对于URL有意义的。

  /正则/ 的一个基本组件是元字符。它们有特殊的含义，如下表：

| 元字符                 | 意义                       |
|------------------------+----------------------------|
| ~\~                    | 转义下一个字符             |
| ~^~                    | 匹配URL的开头              |
| ~$~                    | 匹配URL的结尾              |
| ~.~                    | 匹配任意字符               |
| @<code>\vert@</code>   | 逻辑或                     |
|------------------------+----------------------------|
| @<code>[...]@</code>   | 字符集                     |
| @<code>[\^...]@</code> | @<code>[...]@</code>的反义 |

  如果想要匹配一个元字符（或一个量词，见下），它们应用反斜线转义，例如：
  - ~https://www\.gogole\.com/~
    =~ ~https://www.google.com/~ 。

  ~^~ 和 ~$~ 都是锚点，用来定位而非匹配字符，例如：
  - ~^https://~ =~ ~https://www.google.com/~
    而 !~ ~http://www.google.com/search?q=https~ 。

  除了 ~^~ 、 ~$~ 之外，还有其它锚点——以 /转义序列/ 的形式提供：

| 锚点 | 意义           |
|------+----------------|
| ~\b~ | 匹配字符的边界 |
| ~\B~ | ~\b~ 的反义    |


  ~|~ 意指逻辑或，例如：
  - ~https://www.google.com~ =~ ~google|yahoo~
    而 !~ ~http://www.bing.com~ 。

  事实上， ~|~ 在 /组/ 中更常用。

  字符集是它所匹配字符的集合，例如：
  - ~[aA]~ =~ ~a~ 或 ~A~

  连字符 ~-~ 在字符集中表示ASCII码表中的一段字符，例如：
  - ~[a-z]~ =~ 所有小写字母
  - ~[0-9]~ =~ 所有数字

  *注意：* 要在字符集中包括连字符，使用 ~\-~ 。
  ~-~ 在其它地方没有特殊意义。

  /正则/ 预定义的一些常用的字符集，也以 /转义序列/ 的形式给出：

| 转义序列 | 意义                                   |
|----------+----------------------------------------|
| ~\w~     | 匹配一个单词字符（字母、数字和下划线） |
| ~\W~     | ~\w~ 的反义                            |
| ~\d~     | 匹配一个数字                           |
| ~\D~     | ~\d~ 的反义                            |
| ~\ddd~   | 匹配ddd号（八进制）ASCII字符           |
| ~\xdd~   | 匹配dd号（十六进制）ASCII字符          |
| ~\udddd~ | 匹配dddd号（十六进制）Unicode字符      |

  正则的另一个基本组件是 /量词/ ，它们附在字符、元字符或 /组/ 之后表示字符应重复多少次：

| 量词    | 意义              |
|---------+-------------------|
| ~*~     | 至少0个，尽可能多 |
| ~+~     | 至少1个，尽可能多 |
| ~?~     | 0或1个，尽可能多  |
| ~{N}~   | 恰好N个           |
| ~{N,}~  | 至少N个，尽可能多 |
| ~{N,M}~ | N到M个，尽可能多  |

  例如：
  - ~^https://www\.google\.com/*~
    =~ 任意以 ~https://www.google.com/~ 开头的URL；
  - ~^http?://~
    =~ 任意以 ~http://~ 或 ~https://~ 开头的URL。

  默认情况下， /Redirector/ 进行“贪婪”模式匹配，也就是匹配尽可能多的字符。
  在量词后附加一个 ~?~ 可以切换到“懒惰”模式。例如：
  - ~https://.*?\.~ 将匹配 ~https://www.google.com~ 中的 ~https://www.~
    而 ~https://.*\.~ 却匹配 ~https://www.google.~.

  一个匹配模式可以被括号隔离起来，即 /组/ ：

| 组                     | 意义     |
|------------------------+----------|
| @<code>(...)@</code>   | 捕获组   |
| @<code>(?:...)@</code> | 非捕获组 |

  捕获组中的内容会保存在自动变量 ~\1~ 到 ~\99~ 中， 从左向右、由外至里编号。
  捕获组可以进行 /反向引用/ ，例如：
  - ~http://(\w+)\.wikipedia\.org/\1/~ =~
    ~http://zh.wikipedia.org/zh/Google~
    而 !~ ~http://zh.wikipedia.org/zh-cn/Google~

  在 /正则/ 中， /扩展模式/ 形如@<code>(?x...)@</code>，例如
  @<code>(?:...)@</code>。其它还有：

| 扩展模式               | 意义                         |
|------------------------+------------------------------|
| @<code>(?=...)@</code> | 后接@<code>...@</code>       |
| @<code>(?!...)@</code> | @<code>(?=...)@</code>的反义 |

  应当特别留意模式@<code>(?!...)@</code>，
  因为 /Redirector/ 不提供所谓的 /黑名单/ ，
  因为你完全可以避免使用它。
  要编写一条规则匹配 ~A~ 的同时不匹配 ~B~ ，可以这样写为 ~^(?!.*B).*A~ 。
  例子：
  - 编写一条 /匹配/ 模式，匹配所有属于google.com及其子域的URL，但不属于code.google.com：
    - ~^(?!.*https?://code\.google\.com)https?://(.*?\.)?google\.com~
    - 这个更紧凑：
      ~^https?://(?!code)(.*?\.)?google.com~

  *注意：* @<code>(?=...)@</code>和@<code>(?!...)@</code>不能捕获任何内容。

#<<ADVANCED_SUBSTITUTION>>
* 高级替换
  除了进行匹配， /正则/ 也是字符串替换的有力工具。
  它们的格式很类似，这里只讨论区别。

  它们的主要区别在于 /组/ ，对于捕获组，它们的结果也被用于 /替换/ 。
  如果不打算捕获，保险起见尽量使用非捕获组。

  /替换式/ 除了可以是字符串字面量，也可以是 /被替换式/ 的一部分。
  这里依靠美元符 ~$~ 实现：

| 特殊替换            | 意义                        |
|---------------------+-----------------------------|
| ~$N~ (~$1~ - ~$99~) | 匹配第N个捕获组中的内容     |
| ~$&~                | /被替换式/ 匹配的全部字符串 |
| ~$`~                | ~$&~ 的左边部分             |
| @<code>$'@</code>   | ~$&~ 的右边部分             |

  ~$1~ - ~$99~ 与[[ADVANCED_MATCH][高级匹配]]中的 ~\1~ - ~\99~ 相对应。

  下面是一些例子：
  - 当 /被替换式/ 为 ~(^[^\.]+[^/]+)/[^/]*~
    且 /替换式/ 为 ~$1/zh-cn~,
    ~http://zh.wikipedia.org/zh-hk/Google~
    -> ~http://zh.wikipedia.org/zh-cn/Google~ ；

  - 当 /被替换式/ 为 ~[^\.]+[^/]+~
    且 /替换式/ 为 ~$&.sixxs.org~,
    ~http://www.google.com/~ -> ~http://www.google.com.sixxs.org/~.

  *注意：*
  对于 /锚点/, /替换式/ 会插入相关位置，例如：
  - 当 /被替换式/ 为 ~$~ 且 /替换式/ 为 ~ncr~,
    ~http://www.google.com/~ -> ~http://www.google.com/ncr~.

* 故障处置
  为提高效率， /Redirector/ 在运行时不对规则的正确性执行严格检查。
  所以你可能会遇到如下情形：

  - 左下角提示“等待扩展 /Redirector/ ” ::
    这说明有一条规则错误，虽然它匹配当前页的URL，但 /Redirector/ 并不知道应怎样处理。

  如果你确定问题出在 /Redirector/ 本身，请发送错误报告至<CyrilFeng at gmail dot com>。
  但在此之前，请先确定你已做过下列步骤：
  - 确定在禁用 /Redirector/ 之后问题就会消失；

  - 确定已更新到最新版（ /Cr/ 和 /Redirector/ ）；

  - 如有可能，在重现这个问题时，设置语言为中文或者英语；

  - 同样，用中文或英语描述这个问题；

  - 导出有问题的规则及调试信息，然后随报告一起提交。

* 建议
