trunk/html/zh_CN.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name="ADVANCED_MATCH" id="ADVANCED_MATCH"></a><span class="section-number-2">5</span> 高级匹配</h2>
<div class="outline-text-2" id="text-5">

<p>  <i>高级匹配</i> 指的是使用 <i>正则</i> 进行匹配。
  你可能要去参考其它关于 <i>正则</i> 的文章，但请留意 <i>正则</i> 有很多种，
  这里使用的是JavaScript风格的，类似于Perl风格。
</p>
<p>
  这份简短的指南显然无法介绍关于 <i>正则</i> 的所有方面，这里只挑选那些与URL匹配有关的。
  对于解释，这里也只抽取那些对于URL有意义的。
</p>
<p>
  <i>正则</i> 的一个基本组件是元字符。它们有特殊的含义，如下表：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">元字符</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\</code></td><td class="left">转义下一个字符</td></tr>
<tr><td class="left"><code>^</code></td><td class="left">匹配URL的开头</td></tr>
<tr><td class="left"><code>$</code></td><td class="left">匹配URL的结尾</td></tr>
<tr><td class="left"><code>.</code></td><td class="left">匹配任意字符</td></tr>
<tr><td class="left"><code>&#124;</code></td><td class="left">逻辑或</td></tr>
</tbody>
<tbody>
<tr><td class="left"><code>[&hellip;]</code></td><td class="left">字符集</td></tr>
<tr><td class="left"><code>[^&hellip;]</code></td><td class="left"><code>[&hellip;]</code>的反义</td></tr>
</tbody>
</table>


<p>
  如果想要匹配一个元字符（或一个量词，见下），它们应用反斜线转义，例如：
</p><ul>
<li><code>https://www\.gogole\.com/</code>
    =~ <code>https://www.google.com/</code> 。
</li>
</ul>


<p>
  <code>^</code> 和 <code>$</code> 都是锚点，用来定位而非匹配字符，例如：
</p><ul>
<li><code>^https://</code> =~ <code>https://www.google.com/</code>
    而 !~ <code>http://www.google.com/search?q=https</code> 。
</li>
</ul>


<p>
  除了 <code>^</code> 、 <code>$</code> 之外，还有其它锚点——以 <i>转义序列</i> 的形式提供：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">锚点</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\b</code></td><td class="left">匹配字符的边界</td></tr>
<tr><td class="left"><code>\B</code></td><td class="left"><code>\b</code> 的反义</td></tr>
</tbody>
</table>



<p>
  <code>|</code> 意指逻辑或，例如：
</p><ul>
<li><code>https://www.google.com</code> =~ <code>google|yahoo</code>
    而 !~ <code>http://www.bing.com</code> 。
</li>
</ul>


<p>
  事实上， <code>|</code> 在 <i>组</i> 中更常用。
</p>
<p>
  字符集是它所匹配字符的集合，例如：
</p><ul>
<li><code>[aA]</code> =~ <code>a</code> 或 <code>A</code>
</li>
</ul>


<p>
  连字符 <code>-</code> 在字符集中表示ASCII码表中的一段字符，例如：
</p><ul>
<li><code>[a-z]</code> =~ 所有小写字母
</li>
<li><code>[0-9]</code> =~ 所有数字
</li>
</ul>


<p>
  <b>注意：</b> 要在字符集中包括连字符，使用 <code>\-</code> 。
  <code>-</code> 在其它地方没有特殊意义。
</p>
<p>
  <i>正则</i> 预定义的一些常用的字符集，也以 <i>转义序列</i> 的形式给出：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">转义序列</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\w</code></td><td class="left">匹配一个单词字符（字母、数字和下划线）</td></tr>
<tr><td class="left"><code>\W</code></td><td class="left"><code>\w</code> 的反义</td></tr>
<tr><td class="left"><code>\d</code></td><td class="left">匹配一个数字</td></tr>
<tr><td class="left"><code>\D</code></td><td class="left"><code>\d</code> 的反义</td></tr>
<tr><td class="left"><code>\ddd</code></td><td class="left">匹配ddd号（八进制）ASCII字符</td></tr>
<tr><td class="left"><code>\xdd</code></td><td class="left">匹配dd号（十六进制）ASCII字符</td></tr>
<tr><td class="left"><code>\udddd</code></td><td class="left">匹配dddd号（十六进制）Unicode字符</td></tr>
</tbody>
</table>


<p>
  正则的另一个基本组件是 <i>量词</i> ，它们附在字符、元字符或 <i>组</i> 之后表示字符应重复多少次：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">量词</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>*</code></td><td class="left">至少0个，尽可能多</td></tr>
<tr><td class="left"><code>+</code></td><td class="left">至少1个，尽可能多</td></tr>
<tr><td class="left"><code>?</code></td><td class="left">0或1个，尽可能多</td></tr>
<tr><td class="left"><code>{N}</code></td><td class="left">恰好N个</td></tr>
<tr><td class="left"><code>{N,}</code></td><td class="left">至少N个，尽可能多</td></tr>
<tr><td class="left"><code>{N,M}</code></td><td class="left">N到M个，尽可能多</td></tr>
</tbody>
</table>


<p>
  例如：
</p><ul>
<li><code>^https://www\.google\.com/*</code>
    =~ 任意以 <code>https://www.google.com/</code> 开头的URL；
</li>
<li><code>^http?://</code>
    =~ 任意以 <code>http://</code> 或 <code>https://</code> 开头的URL。
</li>
</ul>


<p>
  默认情况下， <i>Redirector</i> 进行“贪婪”模式匹配，也就是匹配尽可能多的字符。
  在量词后附加一个 <code>?</code> 可以切换到“懒惰”模式。例如：
</p><ul>
<li><code>https://.*?\.</code> 将匹配 <code>https://www.google.com</code> 中的 <code>https://www.</code>
    而 <code>https://.*\.</code> 却匹配 <code>https://www.google.</code>.
</li>
</ul>


<p>
  一个匹配模式可以被括号隔离起来，即 <i>组</i> ：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">组</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>(&hellip;)</code></td><td class="left">捕获组</td></tr>
<tr><td class="left"><code>(?:&hellip;)</code></td><td class="left">非捕获组</td></tr>
</tbody>
</table>


<p>
  捕获组中的内容会保存在自动变量 <code>\1</code> 到 <code>\99</code> 中， 从左向右、由外至里编号。
  捕获组可以进行 <i>反向引用</i> ，例如：
</p><ul>
<li><code>http://(\w+)\.wikipedia\.org/\1/</code> =~
    <code>http://zh.wikipedia.org/zh/Google</code>
    而 !~ <code>http://zh.wikipedia.org/zh-cn/Google</code>
</li>
</ul>


<p>
  在 <i>正则</i> 中， <i>扩展模式</i> 形如<code>(?x&hellip;)</code>，例如
  <code>(?:&hellip;)</code>。其它还有：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">扩展模式</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>(?=&hellip;)</code></td><td class="left">后接<code>&hellip;</code></td></tr>
<tr><td class="left"><code>(?!&hellip;)</code></td><td class="left"><code>(?=&hellip;)</code>的反义</td></tr>
</tbody>
</table>


<p>
  应当特别留意模式<code>(?!&hellip;)</code>，
  因为 <i>Redirector</i> 不提供所谓的 <i>黑名单</i> ，
  因为你完全可以避免使用它。
  要编写一条规则匹配 <code>A</code> 的同时不匹配 <code>B</code> ，可以这样写为 <code>^(?!.*B).*A</code> 。
  例子：
</p><ul>
<li>编写一条 <i>匹配</i> 模式，匹配所有属于google.com及其子域的URL，但不属于code.google.com：
<ul>
<li><code>^(?!.*https?://code\.google\.com)https?://(.*?\.)?google\.com</code>
</li>
<li>这个更紧凑：
      <code>^https?://(?!code)(.*?\.)?google.com</code>
</li>
</ul>

</li>
</ul>


<p>
  <b>注意：</b> <code>(?=&hellip;)</code>和<code>(?!&hellip;)</code>不能捕获任何内容。
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name="ADVANCED_SUBSTITUTION" id="ADVANCED_SUBSTITUTION"></a><span class="section-number-2">6</span> 高级替换</h2>
<div class="outline-text-2" id="text-6">

<p>  除了进行匹配， <i>正则</i> 也是字符串替换的有力工具。
  它们的格式很类似，这里只讨论区别。
</p>
<p>
  它们的主要区别在于 <i>组</i> ，对于捕获组，它们的结果也被用于 <i>替换</i> 。
  如果不打算捕获，保险起见尽量使用非捕获组。
</p>
<p>
  <i>替换式</i> 除了可以是字符串字面量，也可以是 <i>被替换式</i> 的一部分。
  这里依靠美元符 <code>$</code> 实现：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">特殊替换</th><th scope="col" class="left">意义</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>$N</code> (<code>$1</code> - <code>$99</code>)</td><td class="left">匹配第N个捕获组中的内容</td></tr>
<tr><td class="left"><code>$&amp;</code></td><td class="left"><i>被替换式</i> 匹配的全部字符串</td></tr>
<tr><td class="left"><code>$`</code></td><td class="left"><code>$&amp;</code> 的左边部分</td></tr>
<tr><td class="left"><code>$'</code></td><td class="left"><code>$&amp;</code> 的右边部分</td></tr>
</tbody>
</table>


<p>
  <code>$1</code> - <code>$99</code> 与<a href="#sec-5">高级匹配</a>中的 <code>\1</code> - <code>\99</code> 相对应。
</p>
<p>
  下面是一些例子：
</p><ul>
<li>当 <i>被替换式</i> 为 <code>(^[^\.]+[^/]+)/[^/]*</code>
    且 <i>替换式</i> 为 <code>$1/zh-cn</code>,
    <code>http://zh.wikipedia.org/zh-hk/Google</code>
    -&gt; <code>http://zh.wikipedia.org/zh-cn/Google</code> ；

</li>
<li>当 <i>被替换式</i> 为 <code>[^\.]+[^/]+</code>
    且 <i>替换式</i> 为 <code>$&amp;.sixxs.org</code>,
    <code>http://www.google.com/</code> -&gt; <code>http://www.google.com.sixxs.org/</code>.
</li>
</ul>


<p>
  <b>注意：</b>
  对于 <i>锚点</i>, <i>替换式</i> 会插入相关位置，例如：
</p><ul>
<li>当 <i>被替换式</i> 为 <code>$</code> 且 <i>替换式</i> 为 <code>ncr</code>,
    <code>http://www.google.com/</code> -&gt; <code>http://www.google.com/ncr</code>.
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 故障处置</h2>
<div class="outline-text-2" id="text-7">

<p>  为提高效率， <i>Redirector</i> 在运行时不对规则的正确性执行严格检查。
  所以你可能会遇到如下情形：
</p>
<dl>
<dt>左下角提示“等待扩展 <i>Redirector</i> ”</dt><dd>
<p>
    这说明有一条规则错误，虽然它匹配当前页的URL，但 <i>Redirector</i> 并不知道应怎样处理。
</p></dd>
</dl>


<p>
  如果你确定问题出在 <i>Redirector</i> 本身，请发送错误报告至&lt;CyrilFeng at gmail dot com&gt;。
  但在此之前，请先确定你已做过下列步骤：
</p><ul>
<li>确定在禁用 <i>Redirector</i> 之后问题就会消失；

</li>
<li>确定已更新到最新版（ <i>Cr</i> 和 <i>Redirector</i> ）；

</li>
<li>如有可能，在重现这个问题时，设置语言为中文或者英语；

</li>
<li>同样，用中文或英语描述这个问题；

</li>
<li>导出有问题的规则及调试信息，然后随报告一起提交。
</li>
</ul>


</div>

</div>
